app/views/courses/index.json.jbuilder

SELECT "courses".* FROM "courses" WHERE "courses"."category" = $1  [["category", "eitaaa"]]
---
    json.category category
    json.courses Course.where(category: category) do |course|