app/controllers/cities_controller.rb

    def index
<<<<<<< HEAD
        render json: City.order(:name).pluck(:id, :name)
    end
end
=======
        @cities =  City.all
---
SELECT "cities"."name" FROM "cities"
SELECT "cities".* FROM "cities" WHERE "cities"."deleted_at" IS NULL

    def show
        @city = City.find(params[:id])
---
SELECT  "cities".* FROM "cities" WHERE "cities"."deleted_at" IS NULL AND "cities"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]