app/controllers/courses_controller.rb

    def index
        @courses =  Course.all.order(:name)
---
SELECT "courses".* FROM "courses" ORDER BY "courses"."name" ASC