app/controllers/numbeo_controller.rb

    def index
        url = "https://www.numbeo.com/cost-of-living/in/" + params[:city].capitalize
        doc = Nokogiri::HTML(open(url))
        pathPriceValue = doc.xpath("//*[contains(concat( ' ', @class, ' ' ), concat( ' ', 'priceValue', ' ' ))]")

        prices = Array.new
        pathPriceValue.each do |a|
            prices << a.children.text.split(" C$").first.split().first.sub(",","").to_d
        end

        @city = City.find_by(name: params[:city].capitalize)

        if @city.blank?
            @city = City.create(prepare_params(params[:city].capitalize, prices))
---
SELECT  "cities".* FROM "cities" WHERE "cities"."deleted_at" IS NULL AND "cities"."name" = $1 LIMIT $2  [["name", "Montreal"], ["LIMIT", 1]]
INSERT INTO "cities" ("name", "aluguel_centro", "busao", "mercado", "energia", "internet", "academia", "role", "roupas", "salariomedio", "created_at", "updated_at", "monthly_cost", "mobile", "restaurante", "health_care", "aluguel_fora", "province_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18) RETURNING "id"