app/controllers/provinces_controller.rb

SELECT "provinces".* FROM "provinces" ORDER BY "provinces"."name" ASC
---
    def index
        @provinces =    Province.order(:name)