app/views/provinces/index.json.jbuilder

SELECT "cities".* FROM "cities" WHERE "cities"."deleted_at" IS NULL AND "cities"."province_id" = $1 ORDER BY "cities"."name" ASC  [["province_id", 9]]
---
    json.name p.name
    json.cities p.cities.order(:name) do |c|